package easy.ex4;

public class Main {
    public static void main(String[] args) {
        // 4.	Написать функцию, которая принимает на вход строку, и возвращает
        // сумму всех найденных в этой строке чисел
        Search search = new Search();
        System.out.println(search.sum("солнце5 светит 5 над 10 нами"));
    }
}
